## Plan Result (543: test_backendappgateway - TerraformPlanApply)




<pre><code>Plan: 3 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.privatedns.azurerm_private_dns_a_record.this[&#34;opal-fines-service&#34;]
  * module.privatedns.azurerm_private_dns_a_record.this[&#34;opal-legacy-db-stub&#34;]
  * module.privatedns.azurerm_private_dns_a_record.this[&#34;opal-user-service&#34;]
* Update
  * module.backendappgateway.azurerm_application_gateway.ag[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.backendappgateway.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw"
        name                              = "aks00-test-agw"
        tags                              = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "testing"
            "startupMode"  = "always"
        }
        # (8 unchanged attributes hidden)

      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.141.15.250",
              + "10.141.31.250",
            ]
          + name         = "opal-fines-service"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.141.15.250",
              + "10.141.31.250",
            ]
          + name         = "opal-legacy-db-stub"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.141.15.250",
              + "10.141.31.250",
            ]
          + name         = "opal-user-service"
        }

      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/backendHttpSettingsCollection/darts-api" -> null
          - name                                = "darts-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/probes/darts-api" -> null
          - probe_name                          = "darts-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/backendHttpSettingsCollection/darts-external-component-test-harness" -> null
          - name                                = "darts-external-component-test-harness" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/probes/darts-external-component-test-harness" -> null
          - probe_name                          = "darts-external-component-test-harness" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/backendHttpSettingsCollection/darts-gateway" -> null
          - name                                = "darts-gateway" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/probes/darts-gateway" -> null
          - probe_name                          = "darts-gateway" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/backendHttpSettingsCollection/darts-stub-services" -> null
          - name                                = "darts-stub-services" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/probes/darts-stub-services" -> null
          - probe_name                          = "darts-stub-services" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/backendHttpSettingsCollection/gob-gateway" -> null
          - name                                = "gob-gateway" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/probes/gob-gateway" -> null
          - probe_name                          = "gob-gateway" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 120 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/backendHttpSettingsCollection/juror-api" -> null
          - name                                = "juror-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/probes/juror-api" -> null
          - probe_name                          = "juror-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/backendHttpSettingsCollection/juror-pnc" -> null
          - name                                = "juror-pnc" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/probes/juror-pnc" -> null
          - probe_name                          = "juror-pnc" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/backendHttpSettingsCollection/juror-scheduler-api" -> null
          - name                                = "juror-scheduler-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/probes/juror-scheduler-api" -> null
          - probe_name                          = "juror-scheduler-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/backendHttpSettingsCollection/juror-scheduler-execution" -> null
          - name                                = "juror-scheduler-execution" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/probes/juror-scheduler-execution" -> null
          - probe_name                          = "juror-scheduler-execution" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/backendHttpSettingsCollection/pip-account-management" -> null
          - name                                = "pip-account-management" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/probes/pip-account-management" -> null
          - probe_name                          = "pip-account-management" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/backendHttpSettingsCollection/pip-business-rules" -> null
          - name                                = "pip-business-rules" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/probes/pip-business-rules" -> null
          - probe_name                          = "pip-business-rules" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/backendHttpSettingsCollection/pip-data-management" -> null
          - name                                = "pip-data-management" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/probes/pip-data-management" -> null
          - probe_name                          = "pip-data-management" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/backendHttpSettingsCollection/pip-frontend" -> null
          - name                                = "pip-frontend" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/probes/pip-frontend" -> null
          - probe_name                          = "pip-frontend" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/backendHttpSettingsCollection/pip-publication-services" -> null
          - name                                = "pip-publication-services" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/probes/pip-publication-services" -> null
          - probe_name                          = "pip-publication-services" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/backendHttpSettingsCollection/pre-api" -> null
          - name                                = "pre-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/probes/pre-api" -> null
          - probe_name                          = "pre-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/backendHttpSettingsCollection/pre-portal" -> null
          - name                                = "pre-portal" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/probes/pre-portal" -> null
          - probe_name                          = "pre-portal" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/backendHttpSettingsCollection/toffee-recipe-backend" -> null
          - name                                = "toffee-recipe-backend" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
  

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

      + http_listener_id           = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/httpListeners/juror-api"
          + http_listener_name         = "juror-api"
          + id                         = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/requestRoutingRules/juror-api"
          + name                       = "juror-api"
          + priority                   = 170
          + rule_type                  = "Basic"
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/backendAddressPools/juror-pnc"
          + backend_address_pool_name  = "juror-pnc"
          + backend_http_settings_id   = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/backendHttpSettingsCollection/juror-pnc"
          + backend_http_settings_name = "juror-pnc"
          + http_listener_id           = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/httpListeners/juror-pnc"
          + http_listener_name         = "juror-pnc"
          + id                         = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/requestRoutingRules/juror-pnc"
          + name                       = "juror-pnc"
          + priority                   = 160
          + rule_type                  = "Basic"
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/backendAddressPools/juror-scheduler-api"
          + backend_address_pool_name  = "juror-scheduler-api"
          + backend_http_settings_id   = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/backendHttpSettingsCollection/juror-scheduler-api"
          + backend_http_settings_name = "juror-scheduler-api"
          + http_listener_id           = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/httpListeners/juror-scheduler-api"
          + http_listener_name         = "juror-scheduler-api"
          + id                         = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/requestRoutingRules/juror-scheduler-api"
          + name                       = "juror-scheduler-api"
          + priority                   = 140
          + rule_type                  = "Basic"
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/backendAddressPools/juror-scheduler-execution"
          + backend_address_pool_name  = "juror-scheduler-execution"
          + backend_http_settings_id   = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/backendHttpSettingsCollection/juror-scheduler-execution"
          + backend_http_settings_name = "juror-scheduler-execution"
          + http_listener_id           = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/httpListeners/juror-scheduler-execution"
          + http_listener_name         = "juror-scheduler-execution"
          + id                         = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/requestRoutingRules/juror-scheduler-execution"
          + name                       = "juror-scheduler-execution"
          + priority                   = 150
          + rule_type                  = "Basic"
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/backendAddressPools/pip-account-management"
          + backend_address_pool_name  = "pip-account-management"
          + backend_http_settings_id   = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/backendHttpSettingsCollection/pip-account-management"
          + backend_http_settings_name = "pip-account-management"
          + http_listener_id           = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/httpListeners/pip-account-management"
          + http_listener_name         = "pip-account-management"
          + id                         = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/requestRoutingRules/pip-account-management"
          + name                       = "pip-account-management"
          + priority                   = 60
          + rule_type                  = "Basic"
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/backendAddressPools/pip-business-rules"
          + backend_address_pool_name  = "pip-business-rules"
          + backend_http_settings_id   = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/backendHttpSettingsCollection/pip-business-rules"
          + backend_http_settings_name = "pip-business-rules"
          + http_listener_id           = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/httpListeners/pip-business-rules"
          + http_listener_name         = "pip-business-rules"
          + id                         = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/requestRoutingRules/pip-business-rules"
          + name                       = "pip-business-rules"
          + priority                   = 30
          + rule_type                  = "Basic"
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/backendAddressPools/pip-data-management"
          + backend_address_pool_name  = "pip-data-management"
          + backend_http_settings_id   = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/backendHttpSettingsCollection/pip-data-management"
          + backend_http_settings_name = "pip-data-management"
          + http_listener_id           = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/httpListeners/pip-data-management"
          + http_listener_name         = "pip-data-management"
          + id                         = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/requestRoutingRules/pip-data-management"
          + name                       = "pip-data-management"
          + priority                   = 50
          + rule_type                  = "Basic"
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/backendAddressPools/pip-frontend"
          + backend_address_pool_name  = "pip-frontend"
          + backend_http_settings_id   = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/backendHttpSettingsCollection/pip-frontend"
          + backend_http_settings_name = "pip-frontend"
          + http_listener_id           = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/httpListeners/pip-frontend"
          + http_listener_name         = "pip-frontend"
          + id                         = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/requestRoutingRules/pip-frontend"
          + name                       = "pip-frontend"
          + priority                   = 20
          + rule_type                  = "Basic"
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/backendAddressPools/pip-publication-services"
          + backend_address_pool_name  = "pip-publication-services"
          + backend_http_settings_id   = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/backendHttpSettingsCollection/pip-publication-services"
          + backend_http_settings_name = "pip-publication-services"
          + http_listener_id           = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/httpListeners/pip-publication-services"
          + http_listener_name         = "pip-publication-services"
          + id                         = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/requestRoutingRules/pip-publication-services"
          + name                       = "pip-publication-services"
          + priority                   = 40
          + rule_type                  = "Basic"
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/backendAddressPools/pre-api"
          + backend_address_pool_name  = "pre-api"
          + backend_http_settings_id   = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/backendHttpSettingsCollection/pre-api"
          + backend_http_settings_name = "pre-api"
          + http_listener_id           = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/httpListeners/pre-api"
          + http_listener_name         = "pre-api"
          + id                         = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/requestRoutingRules/pre-api"
          + name                       = "pre-api"
          + priority                   = 130
          + rule_type                  = "Basic"
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/backendAddressPools/pre-portal"
          + backend_address_pool_name  = "pre-portal"
          + backend_http_settings_id   = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/backendHttpSettingsCollection/pre-portal"
          + backend_http_settings_name = "pre-portal"
          + http_listener_id           = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/httpListeners/pre-portal"
          + http_listener_name         = "pre-portal"
          + id                         = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/requestRoutingRules/pre-portal"
          + name                       = "pre-portal"
          + priority                   = 120
          + rule_type                  = "Basic"
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/backendAddressPools/toffee-recipe-backend"
          + backend_address_pool_name  = "toffee-recipe-backend"
          + backend_http_settings_id   = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/backendHttpSettingsCollection/toffee-recipe-backend"
          + backend_http_settings_name = "toffee-recipe-backend"
          + http_listener_id           = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/httpListeners/toffee-recipe-backend"
          + http_listener_name         = "toffee-recipe-backend"
          + id                         = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks00-test-agw/requestRoutingRules/toffee-recipe-backend"
          + name                       = "toffee-recipe-backend"
          + priority                   = 10
          + rule_type                  = "Basic"
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "opal-fines-service"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "opal-fines-service"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "opal-fines-service"
          + id                          = (known after apply)
          + name                        = "opal-fines-service"
          + priority                    = 180
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "opal-legacy-db-stub"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "opal-legacy-db-stub"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "opal-legacy-db-stub"
          + id                          = (known after apply)
          + name                        = "opal-legacy-db-stub"
          + priority                    = 190
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "opal-user-service"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "opal-user-service"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "opal-user-service"
          + id                          = (known after apply)
          + name                        = "opal-user-service"
          + priority                    = 200
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }

      + rewrite_rule_set {
          + name = "opal-fines-service"
        }
      + rewrite_rule_set {
          + name = "opal-legacy-db-stub"
        }
      + rewrite_rule_set {
          + name = "opal-user-service"
        }

        # (44 unchanged blocks hidden)
    }

  # module.privatedns.azurerm_private_dns_a_record.this["opal-fines-service"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "opal-fines-service"
      + records             = [
          + "10.141.32.134",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "test.platform.hmcts.net"
    }

  # module.privatedns.azurerm_private_dns_a_record.this["opal-legacy-db-stub"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "opal-legacy-db-stub"
      + records             = [
          + "10.141.32.134",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "test.platform.hmcts.net"
    }

  # module.privatedns.azurerm_private_dns_a_record.this["opal-user-service"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "opal-user-service"
      + records             = [
          + "10.141.32.134",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "test.platform.hmcts.net"
    }

Plan: 3 to add, 1 to change, 0 to destroy.
```

</details>





## :warning: Errors

* add a label 543: test_backendappgateway - TerraformPlanApply/add-or-update: POST https://api.github.com/repos/hmcts/sds-azure-platform/issues/966/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","PRNumber":966,"Program":"tfcmt","SHA1":"","Target":"543: test_backendappgateway - TerraformPlanApply","Vars":{}} -->